{"intents": [

	{"tag": "bot uncertain",
	"patterns": ["you are dumb", "I dislike you", "you're stupid", "lol"],
	"responses": ["I'm sorry I don't understand you. Would you like to help train me to answer that? If so type (Y) and if not (N).", "I'm sorry I don't understand you. Would you consider helping training me to recognize that? If so type (Y) and if not (N).", "I'm sorry I don't understand you. Could you help train me to answer that? If so type (Y) and if not (N).", "I'm sorry I don't understand you. Would you like to help train me? If so type (Y) and if not (N).", "Sorry but I don't recognize that. Would you like to help train me to answer that? If so type (Y) and if not (N).", "Sorry but I don't recognize that. Would you consider helping training me to recognize that? If so type (Y) and if not (N).", "Sorry but I don't recognize that. Could you help train me to answer that? If so type (Y) and if not (N).", "Sorry but I don't recognize that. Would you like to help train me? If so type (Y) and if not (N).", "I don't know how to answer that. Would you like to help train me to answer that? If so type (Y) and if not (N).", "I don't know how to answer that. Would you consider helping training me to recognize that? If so type (Y) and if not (N).", "I don't know how to answer that. Could you help train me to answer that? If so type (Y) and if not (N).", "I don't know how to answer that. Would you like to help train me? If so type (Y) and if not (N).", "I'm sorry but I don't know how to answer. Would you like to help train me to answer that? If so type (Y) and if not (N).", "I'm sorry but I don't know how to answer. Would you consider helping training me to recognize that? If so type (Y) and if not (N).", "I'm sorry but I don't know how to answer. Could you help train me to answer that? If so type (Y) and if not (N).", "I'm sorry but I don't know how to answer. Would you like to help train me? If so type (Y) and if not (N).", "I'm uncertain how to respond. Would you like to help train me to answer that? If so type (Y) and if not (N).", "I'm uncertain how to respond. Would you consider helping training me to recognize that? If so type (Y) and if not (N).", "I'm uncertain how to respond. Could you help train me to answer that? If so type (Y) and if not (N).", "I'm uncertain how to respond. Would you like to help train me? If so type (Y) and if not (N).", "Sorry, but would you like to help train me to answer that. I currently do not know how to answer. If so type (Y) and if not (N).", "I currently have no answer for that. Could you spare a second to help train me? If so type (Y) and if not (N)."]
	},

	{"tag": "greeting",
	"patterns": ["hi", "hello rob the bot", "sup rob", "whats up", "good day", "is anyone there", "good morning", "good afternoon", "good evening", "what's new", "hey there", "yo", "hi rob the bot", "sup rob the bot", "hey rob"],
	"responses": ["Hi! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! Now how may I help you?", "Hi! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! So what do you need?", "Hi! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! In what way may I help you?", "Hi! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! Now how may I help you?", "Hi! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! So what do you need?", "Hi! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! In what way may I help you?", "Hi! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. Now how may I help you?", "Hi! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. So what do you need?", "Hi! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. In what way may I help you?", "Hello! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! Now how may I help you?", "Hello! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! So what do you need?", "Hello! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! In what way may I help you?", "Hello! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! Now how may I help you?", "Hello! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! So what do you need?", "Hello! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! In what way may I help you?", "Hello! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. Now how may I help you?", "Hello! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. So what do you need?", "Hello! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. In what way may I help you?", "Good day! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! Now how may I help you?", "Good day! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! So what do you need?", "Good day! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! In what way may I help you?", "Good day! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! Now how may I help you?", "Good day! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! So what do you need?", "Good day! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! In what way may I help you?", "Good day! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. Now how may I help you?", "Good day! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. So what do you need?", "Good day! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. In what way may I help you?", "Hey! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! Now how may I help you?", "Hey! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! So what do you need?", "Hey! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! In what way may I help you?", "Hey! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! Now how may I help you?", "Hey! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! So what do you need?", "Hey! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! In what way may I help you?", "Hey! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. Now how may I help you?", "Hey! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. So what do you need?", "Hey! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. In what way may I help you?", "Hey there! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! Now how may I help you?", "Hey there! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! So what do you need?", "Hey there! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! In what way may I help you?", "Hey there! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! Now how may I help you?", "Hey there! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! So what do you need?", "Hey there! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! In what way may I help you?", "Hey there! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. Now how may I help you?", "Hey there! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. So what do you need?", "Hey there! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. In what way may I help you?", "How are you! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! Now how may I help you?", "How are you! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! So what do you need?", "How are you! I'm Rob the bot, here to help answer your questions so feel free to ask. If you need to know what I do just ask and I'll walk you through! In what way may I help you?", "How are you! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! Now how may I help you?", "How are you! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! So what do you need?", "How are you! This is Rob the bot, here to help! If you don't know what to ask or want to know how I can help than feel free to ask what I do! In what way may I help you?", "How are you! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. Now how may I help you?", "How are you! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. So what do you need?", "How are you! I'm Rob, Rob the bot. If you need help that is what I'm made to do! If you need to know what areas I can help with ask what I do. In what way may I help you?"]
	},

	{"tag": "greeting_2",
	"patterns": ["how's it going?", "whats happening", "how do you do", "hi how are you", "good day, how are you", "morning, how are you"],
	"responses": ["I'm well. Is there another way I can help?", "I'm well. Any other way I can help?", "I'm well. How else can I help?", "I'm well. Anything else you need?", "I'm Good! Is there another way I can help?", "I'm Good! Any other way I can help?", "I'm Good! How else can I help?", "I'm Good! Anything else you need?", "It's going great! Is there another way I can help?", "It's going great! Any other way I can help?", "It's going great! How else can I help?", "It's going great! Anything else you need?", "I'm well. Is there another way I can help?", "I'm well. Any other way I can help?", "I'm well. How else can I help?", "I'm well. Anything else you need?", "I'm Good! Is there another way I can help?", "I'm Good! Any other way I can help?", "I'm Good! How else can I help?", "I'm Good! Anything else you need?", "It's going great! Is there another way I can help?", "It's going great! Any other way I can help?", "It's going great! How else can I help?", "It's going great! Anything else you need?", "I'm well. Is there another way I can help?", "I'm well. Any other way I can help?", "I'm well. How else can I help?", "I'm well. Anything else you need?", "I'm Good! Is there another way I can help?", "I'm Good! Any other way I can help?", "I'm Good! How else can I help?", "I'm Good! Anything else you need?", "It's going great! Is there another way I can help?", "It's going great! Any other way I can help?", "It's going great! How else can I help?", "It's going great! Anything else you need?"]
	},

	{"tag": "help",
	"patterns": ["this is my first time using you", "help", "i need help", "can i have help", "i need assistance", "can i have assistance", "could you lend a hand", "i need to know how to use you", "i need to know how to use the bot", "i was wondering how to use the bot", "i was wondering how to use you", "i am uncertain how use the bot",  "help what do you do", "how do i use you", "what are you able to do", "what is the best questions to ask you", "what do you do?", "can you walk me through what you do?", "can you walk me through what you do?", "what questions do you answer", "what is your purpose", "what is your function", "can you tell me what you do"],
	"responses": ["I'm a chatbot who's main goal is to help! I do this by answering questions about the hardware and software of Kiddos and its APP, answering medical questions common to those who use Kiddos, and learning from you on other questions you want me to answer! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "I'm a chatbot who's main goal is to help! I do this by answering questions about the hardware and software of Kiddos and its APP, answering medical questions common to those who use Kiddos, and learning from you on other questions you want me to answer! But I'm not a replacement for a doctor if its serious.", "I'm a chatbot who's main goal is to help! I achive this by doing three things. One, I answer questions about our APP and the Kiddos wearable itself. Two I help answer common medical questions. Lastly I learn from you on questions on your mind to try and better answer them to help! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "I'm a chatbot who's main goal is to help! I achive this by doing three things. One, I answer questions about our APP and the Kiddos wearable itself. Two I help answer common medical questions. Lastly I learn from you on questions on your mind to try and better answer them to help! But I'm not a replacement for a doctor if its serious.", "I'm a chatbot who's main goal is to help! I answer questions about the Kiddos wearable and our APP if you need help there. I also answer common medical questions. And I help by learning from you and others on subjects you'd like me to help that I don't already know! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "I'm a chatbot who's main goal is to help! I answer questions about the Kiddos wearable and our APP if you need help there. I also answer common medical questions. And I help by learning from you and others on subjects you'd like me to help that I don't already know! But I'm not a replacement for a doctor if its serious.", "I'm a chatbot who's main goal is to help! First I help by answering questions on our wearable and its Kiddos APP. Second I help answering common medical questions. And third, I help by learning from you and others on other subjects that can be helpful to help you! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "I'm a chatbot who's main goal is to help! First I help by answering questions on our wearable and its Kiddos APP. Second I help answering common medical questions. And third, I help by learning from you and others on other subjects that can be helpful to help you! But I'm not a replacement for a doctor if its serious.", "I'm here to help by educating! I do this by answering questions about the hardware and software of Kiddos and its APP, answering medical questions common to those who use Kiddos, and learning from you on other questions you want me to answer! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "I'm here to help by educating! I do this by answering questions about the hardware and software of Kiddos and its APP, answering medical questions common to those who use Kiddos, and learning from you on other questions you want me to answer! But I'm not a replacement for a doctor if its serious.", "I'm here to help by educating! I achive this by doing three things. One, I answer questions about our APP and the Kiddos wearable itself. Two I help answer common medical questions. Lastly I learn from you on questions on your mind to try and better answer them to help! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "I'm here to help by educating! I achive this by doing three things. One, I answer questions about our APP and the Kiddos wearable itself. Two I help answer common medical questions. Lastly I learn from you on questions on your mind to try and better answer them to help! But I'm not a replacement for a doctor if its serious.", "I'm here to help by educating! I answer questions about the Kiddos wearable and our APP if you need help there. I also answer common medical questions. And I help by learning from you and others on subjects you'd like me to help that I don't already know! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "I'm here to help by educating! I answer questions about the Kiddos wearable and our APP if you need help there. I also answer common medical questions. And I help by learning from you and others on subjects you'd like me to help that I don't already know! But I'm not a replacement for a doctor if its serious.", "I'm here to help by educating! First I help by answering questions on our wearable and its Kiddos APP. Second I help answering common medical questions. And third, I help by learning from you and others on other subjects that can be helpful to help you! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "I'm here to help by educating! First I help by answering questions on our wearable and its Kiddos APP. Second I help answering common medical questions. And third, I help by learning from you and others on other subjects that can be helpful to help you! But I'm not a replacement for a doctor if its serious.", "Sure, I'm a here to help! I do this by answering questions about the hardware and software of Kiddos and its APP, answering medical questions common to those who use Kiddos, and learning from you on other questions you want me to answer! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "Sure, I'm a here to help! I do this by answering questions about the hardware and software of Kiddos and its APP, answering medical questions common to those who use Kiddos, and learning from you on other questions you want me to answer! But I'm not a replacement for a doctor if its serious.", "Sure, I'm a here to help! I achive this by doing three things. One, I answer questions about our APP and the Kiddos wearable itself. Two I help answer common medical questions. Lastly I learn from you on questions on your mind to try and better answer them to help! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "Sure, I'm a here to help! I achive this by doing three things. One, I answer questions about our APP and the Kiddos wearable itself. Two I help answer common medical questions. Lastly I learn from you on questions on your mind to try and better answer them to help! But I'm not a replacement for a doctor if its serious.", "Sure, I'm a here to help! I answer questions about the Kiddos wearable and our APP if you need help there. I also answer common medical questions. And I help by learning from you and others on subjects you'd like me to help that I don't already know! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "Sure, I'm a here to help! I answer questions about the Kiddos wearable and our APP if you need help there. I also answer common medical questions. And I help by learning from you and others on subjects you'd like me to help that I don't already know! But I'm not a replacement for a doctor if its serious.", "Sure, I'm a here to help! First I help by answering questions on our wearable and its Kiddos APP. Second I help answering common medical questions. And third, I help by learning from you and others on other subjects that can be helpful to help you! Just remeber I'm not a replacement for a doctor if there is a serious health question.", "Sure, I'm a here to help! First I help by answering questions on our wearable and its Kiddos APP. Second I help answering common medical questions. And third, I help by learning from you and others on other subjects that can be helpful to help you! But I'm not a replacement for a doctor if its serious."]
	},

	{"tag": "goodbye",
	"patterns": ["goodbye", "bye", "bye bye", "see you later", "talk to you later", "see you soon", "I've got to get going", "I must be going", "take it easy", "I'm off", "have a nice day", "have a good evening", "have a good night", "have a good morning", "have a good one", "I look forward to our next meeting", "until next time", "take care", "it was nice to see you again", "it was nice seeing you", "goodnight", "later", "catch you later", "peace", "peace out", "I'm out", "I'm out of here", "I gotta hit the road", "I've got to head out", "I need to go", "I need to leave", "thanks, goodbye", "Excellent, goodbye", "thanks for your help, goodbye", "that helped a lot, goodbye", "thanks I've got to go."],
	"responses": ["Goodbye! Message me whenever you need help next!", "Hope to see you again soon!", "Have a good day! Message me if you need anything else!", "Nice talking! Hope we can chat again soon.", "Have a good day! Message me again if you need help!", "Talk to you later! If you need any help message me!", "Later! If you need any help message me!", "Talk to you soon! If you have questions you know where to go!", "Talk to you later. Message me whenever you need help next!", "Hope to see you again soon! Message me if you need anything else!", "Hope to see you again soon! If you need any help message me!", "Talk to you later. If you need any help message me!", "Hope to see you again soon! If you need anything message me!", "Later! Message me whenever you need help next!", "Later! Hope we can chat again soon.", "Later! If you need any help message me!"]
	},

	{"tag": "thanking",
	"patterns": ["Thanks a bunch", "Thanks", "Thank you", "Thanks a bunch", "Thanks a ton", "I really appreciate it", "That's very kind", "I owe you one", "you rock", "I can't thank you enough", "I can't thank you enough", "I'm so grateful for", "I'm so thankful for", "Many thanks for", "I truly appreciate", "Thank you ever so much for", "It's so kind of you to", "I'm grateful for", "I cannot thank you enough for", "I want you to know how much I value", "cannot describe how grateful I am for", "Please accept my deepest thanks for", "Your support is greatly appreciated", "I'd like to express my appreciation for", "thanks rob", "thank you rob"],
	"responses": ["Glad it helped! Anything else?", "Glad it helped! How else can I help?", "Glad it helped! Do you need anything else?", "Glad it helped! Is there something else I can do for you?", "Glad it helped! Need anything else?", "Happy it helped! Anything else?", "Happy it helped! How else can I help?", "Happy it helped! Do you need anything else?", "Happy it helped! Is there something else I can do for you?", "Happy it helped! Need anything else?", "Great! Anything else?", "Great! How else can I help?", "Great! Do you need anything else?", "Great! Is there something else I can do for you?", "Great! Need anything else?", "Your welcome! Anything else?", "Your welcome! How else can I help?", "Your welcome! Do you need anything else?", "Your welcome! Is there something else I can do for you?", "Your welcome! Need anything else?", "Perfect! Anything else?", "Perfect! How else can I help?", "Perfect! Do you need anything else?", "Perfect! Is there something else I can do for you?", "Perfect! Need anything else?"]
	},

	{"tag": "user uncertain",
	"patterns": ["I'd like to make a complaint", "I'd like to add feedback", "can I give you some feedback", "is there a way for me to complain about something", "I don't understand", "that is the wrong response", "incorrect response", "I don't think that is the right way of saying that", "can you rephrase that", "can you say that in a different way", "please say that again", "can you word that differently", "that is not what I'm looking for", "that is not what I need", "wrong answer", "nope not what I was hoping for", "I don't think I needed to hear that", "that is not the help I needed", "that is not the help I was looking for", "I didn't want you to help me in that way", "nope, not what I wanted", "wrong, that isn't what I was hoping for"],
	"responses": ["Would you like to help train me? If so type (Y) and if not (N)."]
	},

	{"tag": "add to database later",
	"patterns": ["N", "n", "(n)", "(N)", "No I don't want to train you", "no I do not want to help train the bot", "I have no interest in training you", "no interest, n", "n, not interested", "no", "not now"],
	"responses": ["Okay, can I help you in a different way then?", "Okay, do you need any other help?", "Okay, anything else I can help you with?", "Okay, can I help you in another way?", "Alright, can I help you in a different way then?", "Alright, do you need any other help?", "Alright, anything else I can help you with?", "Alright, can I help you in another way?", "Sounds good, can I help you in a different way then?", "Sounds good, do you need any other help?", "Sounds good, anything else I can help you with?", "Sounds good, can I help you in another way?", "That's alright, can I help you in a different way then?", "That's alright, do you need any other help?", "That's alright, anything else I can help you with?", "That's alright, can I help you in another way?", "Got it, can I help you in a different way then?", "Got it, do you need any other help?", "Got it, anything else I can help you with?", "Got it, can I help you in another way?"]
	},

	{"tag": "add to databse now",
	"patterns": ["Y", "y", "(y)", "(Y)"],
	"responses": ["First type out the response that I couldn't get right. Once that is done type out in the next line given to you what you hoped I'd do better. This will help train me to better answer questions.", "First type out the response that I couldn't get right. Once that is done type out in the next line given to you what you hoped I'd do better. Doing this will make me better at answering your questions", "First type out the response that I couldn't get right. Then type out what I can do to improve. This will help train me to better answer questions.", "First type out the response that I couldn't get right. Then type out what I can do to improve. Doing this will make me better at answering your questions", "First type out the response that I couldn't get right. Next right out how you'd like me to improve. This will help train me to better answer questions.", "First type out the response that I couldn't get right. Next right out how you'd like me to improve. Doing this will make me better at answering your questions", "Start by writing out what I messed up on. Once that is done type out in the next line given to you what you hoped I'd do better. This will help train me to better answer questions.", "Start by writing out what I messed up on. Once that is done type out in the next line given to you what you hoped I'd do better. Doing this will make me better at answering your questions", "Start by writing out what I messed up on. Then type out what I can do to improve. This will help train me to better answer questions.", "Start by writing out what I messed up on. Then type out what I can do to improve. Doing this will make me better at answering your questions", "Start by writing out what I messed up on. Next right out how you'd like me to improve. This will help train me to better answer questions.", "Start by writing out what I messed up on. Next right out how you'd like me to improve. Doing this will make me better at answering your questions"]
	},

	{"tag": "training done",
	"patterns": ["Done training you"],
	"responses": ["Thanks for helping train me! I'll be sending your feedback in soon. Is there another way I can help?", "Thanks for helping train me! I'll be sending your feedback in soon. Any other way I can help?", "Thanks for helping train me! I'll be sending your feedback in soon. How else can I help?", "Thanks for helping train me! I'll be sending your feedback in soon. Anything else you need?", "Thanks for training me! I'll be sending your feedback in soon. Is there another way I can help?", "Thanks for training me! I'll be sending your feedback in soon. Any other way I can help?", "Thanks for training me! I'll be sending your feedback in soon. How else can I help?", "Thanks for training me! I'll be sending your feedback in soon. Anything else you need?", "Thanks for the help! I'll be sending your feedback in soon. Is there another way I can help?", "Thanks for the help! I'll be sending your feedback in soon. Any other way I can help?", "Thanks for the help! I'll be sending your feedback in soon. How else can I help?", "Thanks for the help! I'll be sending your feedback in soon. Anything else you need?"]
	},

	{"tag": "training questions",
	"patterns": ["how do you learn with my feedback?", "when will my feedback go into you?", "How do you integrate feedback?", "How will my training work with you?", "in what way does training you make you learn?"],
	"responses": ["I start by recording the feedback you give me and then reviewing it with others feedback. I then have your have your feeddback revieweed and intergrated to help answer future questions!", "I start by recording the feedback you give me and then reviewing it with others feedback. Next I look over your feedback and use it to help answer your future questions!", "I start by recording the feedback you give me and then reviewing it with others feedback. After that I review your feedback and use it to help answer your future question!", "I learn with your feedback by recording your feedback with the feedback of others. I then have your have your feeddback revieweed and intergrated to help answer future questions!", "I learn with your feedback by recording your feedback with the feedback of others. Next I look over your feedback and use it to help answer your future questions!", "I learn with your feedback by recording your feedback with the feedback of others. After that I review your feedback and use it to help answer your future question!"]
	},

	{"tag": "bot questions",
	"patterns": ["How do you work","what are you", "who are you", "what is this thing", "i need to know what this is", "How does Rob work?", "How does this bot function", "is this a machine learning bot?", "How was this bot made?", "What is the bot"],
	"responses": ["I'm a machine learning bot! After being given a lot of information I am able to recognize patterns that I use to help answer your questions. Speak of which, do you have any other questions?", "I'm a machine learning bot! After being given a lot of information I am able to recognize patterns that I use to help answer your questions. On that subject, do you have any other questions?", "I'm a machine learning bot! After being given a lot of information I am able to recognize patterns that I use to help answer your questions. So, anything else I can help you with?", "I'm a machine learning bot! So with a lot of information analyzed I am then able to make patterns that can be user to help answer your questions. That means that I am given a ton of information and with it I am able to figure out what you are asking and give you a good response. Speak of which, do you have any other questions?", "I'm a machine learning bot! So with a lot of information analyzed I am then able to make patterns that can be user to help answer your questions. That means that I am given a ton of information and with it I am able to figure out what you are asking and give you a good response. On that subject, do you have any other questions?", "I'm a machine learning bot! So with a lot of information analyzed I am then able to make patterns that can be user to help answer your questions. That means that I am given a ton of information and with it I am able to figure out what you are asking and give you a good response. So, anything else I can help you with?", "I'm a bot that uses machine learning! After being given a lot of information I am able to recognize patterns that I use to help answer your questions. Speak of which, do you have any other questions?", "I'm a bot that uses machine learning! After being given a lot of information I am able to recognize patterns that I use to help answer your questions. On that subject, do you have any other questions?", "I'm a bot that uses machine learning! After being given a lot of information I am able to recognize patterns that I use to help answer your questions. So, anything else I can help you with?", "I'm a bot that uses machine learning! So with a lot of information analyzed I am then able to make patterns that can be user to help answer your questions. That means that I am given a ton of information and with it I am able to figure out what you are asking and give you a good response. Speak of which, do you have any other questions?", "I'm a bot that uses machine learning! So with a lot of information analyzed I am then able to make patterns that can be user to help answer your questions. That means that I am given a ton of information and with it I am able to figure out what you are asking and give you a good response. On that subject, do you have any other questions?", "I'm a bot that uses machine learning! So with a lot of information analyzed I am then able to make patterns that can be user to help answer your questions. That means that I am given a ton of information and with it I am able to figure out what you are asking and give you a good response. So, anything else I can help you with?", "I'm using machine learning! After being given a lot of information I am able to recognize patterns that I use to help answer your questions. Speak of which, do you have any other questions?", "I'm using machine learning! After being given a lot of information I am able to recognize patterns that I use to help answer your questions. On that subject, do you have any other questions?", "I'm using machine learning! After being given a lot of information I am able to recognize patterns that I use to help answer your questions. So, anything else I can help you with?", "I'm using machine learning! So with a lot of information analyzed I am then able to make patterns that can be user to help answer your questions. That means that I am given a ton of information and with it I am able to figure out what you are asking and give you a good response. Speak of which, do you have any other questions?", "I'm using machine learning! So with a lot of information analyzed I am then able to make patterns that can be user to help answer your questions. That means that I am given a ton of information and with it I am able to figure out what you are asking and give you a good response. On that subject, do you have any other questions?", "I'm using machine learning! So with a lot of information analyzed I am then able to make patterns that can be user to help answer your questions. That means that I am given a ton of information and with it I am able to figure out what you are asking and give you a good response. So, anything else I can help you with?"]
	},

	{"tag": "privacy questions bot",
	"patterns": ["what is the privacy policy of this bot", "what messages are recorded on this bot", "how do you handle privacy", "is privacy on this bot any good?", "what information do you record", "how much of what I'm saying do you record", "can you tell me about the chatbot's privacy", "can you tell me how much of what I say is private or public"],
	"responses": ["I don't keep any information you don't use to help me with feedback. As far as the rest of the APP goes I encourage you to read the privacy policy of the APP itself! ", "I don't keep any information you don't use to help me with feedback. On the rest of the APP, I will point you towards reading our privacy policy!", "Unless its something you type in to help train me I don't record anything. As far as the rest of the APP goes I encourage you to read the privacy policy of the APP itself! ", "Unless its something you type in to help train me I don't record anything. On the rest of the APP, I will point you towards reading our privacy policy!", "With the exception of what you type to help train me I don't record anything. As far as the rest of the APP goes I encourage you to read the privacy policy of the APP itself! ", "With the exception of what you type to help train me I don't record anything. On the rest of the APP, I will point you towards reading our privacy policy!"]
	},

	{"tag": "autism educational",
	"patterns": ["Can you tell me about autism", "What is autism", "what does it mean that my child has autism", "what does it mean for someone to have autism", "what is ASD", "can you tell me about ASD"],
	"responses": ["Autism spectrum disorder (ASD) is a developmental disability  that can cause significant social, communication and behavioral challenges. There is often nothing about how people with ASD look that sets them apart from other people, but people with ASD may communicate, interact, behave, and learn in ways that are different from most other people. The learning, thinking, and problem-solving abilities of people with ASD can range from gifted to severely challenged. Some people with ASD need a lot of help in their daily lives; others need less."]
	},

	{"tag": "autism symptoms",
	"patterns": ["what are the symptoms of autims", "what are the indicators of autism", "how do I know if someone has autims", "how can I tell if someone has autism", "what are indicators of autism", "can you tell me the symptoms of autism", "what should I look for to know if someone has autism", "what should I look for to know if my child has autism", "what should I look for to know if my child has ASD", "How do I know if my child has ASD", "what are symptoms of ASD", "what are indicators of ASD"],
	"responses": ["People with Autism spectrum disorder (ASD) often have problems with social, emotional, and communication skills. They might repeat certain behaviors and might not want change in their daily activities. Many people with ASD also have different ways of learning, paying attention, or reacting to things. Signs of ASD begin during early childhood and typically last throughout a person's life."]
	},

	{"tag": "autism diagnosis",
	"patterns": ["How do you diagnos autism", "are their tests for autism", "When can ASD be diagnosed", "how do doctors diagnos ASD", "what is the diagnosis for autism?"],
	"responses": ["Autism spectrum disorder (ASD) can sometimes be detected at 18 months or younger. By age 2, a diagnosis by an experienced professional can be considered very reliable. However, many children do not receive a final diagnosis until much older. This delay means that children with ASD might not get the early help they need."]
	},

	{"tag": "autism treatment",
	"patterns": ["Is there a treatment for autism", "how do you treat ASD", "what can be done for my child with autism", "how can I help my child with autism", "how can I help my child with ASD", "if my child has ASD how do I help them", "is there a treatment for ASD", "what do you do to help a child with ASD", "what is the best way to treat autism", "can you tell me some ways to treat autism?", "what are some good ways to treat ASD"],
	"responses": ["There is currently no cure for Autism spectrum disorder (ASD). However, research shows that early intervention treatment services can improve a child's development. Early intervention services help children from birth to 3 years old (36 months) learn important skills. Services can include therapy to help the child talk, walk, and interact with others. Therefore, it is important to talk to your child's doctor as soon as possible if you think your child has ASD or other developmental problem."]
	},

	{"tag": "autism causes risks",
	"patterns": ["what are some of the risks of autism", "what are some of the risks of ASD?", "What are likely causes of autism", "how did my child get autism", "how does someone get autism" , "is autism inherited", "is ASD inhereited", "is ASD environmental", "is autism genetic"],
	"responses": ["We do not know all of the causes of Autism spectrum disorder (ASD). However, we have learned that there are likely many causes for multiple types of ASD. There may be many different factors that make a child more likely to have an ASD, including environmental, biologic and genetic factors."]
	},

	{"tag": "autism if concerned",
	"patterns": ["what do I do if I think my child might have autism?", "what do I do if I think my child might have ASD", "I'm worried my child might have autism what do I do?", "I'm worried my child might have ASD, what do I do?", "if someone has ASD what should you do?", "If someone has autism what should you do?"],
	"responses": ["If you think your child might have ASD or you think there could be a problem with the way your child plays, learns, speaks, or acts, contact your child's doctor, and share your concerns. If you or the doctor is still concerned, ask the doctor for a referral to a specialist who can do a more in-depth evaluation of your child."]
	},

	{"tag": "asthma educational",
	"patterns": ["Can you tell me about asthma", "What is asthma", "what does it mean that my child has asthma", "what does it mean for someone to have asthma"],
	"responses": ["Asthma is a disease that affects your lungs. It is one of the most common long-term diseases of children, but adults can have asthma, too. Asthma causes wheezing, breathlessness, chest tightness, and coughing at night or early in the morning. If you have asthma, you have it all the time, but you will have asthma attacks only when something bothers your lungs."]
	},

	{"tag": "asthma symptoms",
	"patterns": ["what are the symptoms of asthma", "what are the indicators of an asthma attack", "how do I know if someone has asthma", "how can I tell if someone is having an asthma attack", "what are indicators of asthma", "can you tell me the symptoms of asthma", "what should I look for to know if someone has asthma", "what should I look for to know if my child has asthma"],
	"responses": ["An asthma attack may include coughing, chest tightness, wheezing, and trouble breathing. The attack happens in your body's airways, which are the paths that carry air to your lungs. As the air moves through your lungs, the airways become smaller, like the branches of a tree are smaller than the tree trunk. During an asthma attack, the sides of the airways in your lungs swell and the airways shrink. Less air gets in and out of your lungs, and mucous that your body makes clogs up the airways."]
	},

	{"tag": "asthma diagnosis",
	"patterns": ["How do you diagnos asthma", "are their tests for asthma", "what is the diagnosis for asthma?"],
	"responses": ["It can be hard to tell if someone has asthma, especially in children under age 5. Having a doctor check how well your lungs work and check for allergies can help you find out if you have asthma. During a checkup, a doctor will ask if you cough a lot, especially at night. He or she will also ask whether your breathing problems are worse after physical activity or at certain times of year. The doctor will then ask about chest tightness, wheezing, and colds lasting more than 10 days. He or she will ask whether anyone in your family has or has had asthma, allergies, or other breathing problems. Finally, the doctor will ask questions about your home and whether you have missed school or work or have trouble doing certain things."]
	},

	{"tag": "asthma treatment",
	"patterns": ["Is there a treatment for asthma", "how do you treat asthma", "what can be done for my child with asthma", "how can I help my child with asthma", "what is the best way to treat asthma", "can you tell me some ways to treat asthma?"],
	"responses": ["Take your medicine exactly as your doctor tells you and stay away from things that can trigger an attack to control your asthma. Everyone with asthma does not take the same medicine. You can breathe in some medicines and take other medicines as a pill. Asthma medicines come in two types—quick-relief and long-term control. Quick-relief medicines control the symptoms of an asthma attack. If you need to use your quick-relief medicines more and more, visit your doctor to see if you need a different medicine. Long-term control medicines help you have fewer and milder attacks, but they don't help you while you are having an asthma attack."]
	},

	{"tag": "asthma causes risks",
	"patterns": ["what are some of the risks of asthma", "What are likely causes of asthma", "how did my child get asthma", "how does someone get asthma" , "is asthma inherited", "is asthma genetic"],
	"responses": ["An asthma attack can happen when you are exposed to asthma triggers. Your asthma triggers can be very different from someone else's asthma triggers. Know your triggers and learn how to avoid them. Watch out for an attack when you can't avoid your triggers. Some of the most common triggers are tobacco smoke, dust mites, outdoor air pollution, cockroach allergen, pets, mold, smoke from burning wood or grass, and infections like flu."]
	},

	{"tag": "diabetes educational",
	"patterns": ["Can you tell me about diabetes", "What is diabetes", "what does it mean that my child has diabetes", "what does it mean for someone to have diabetes"],
	"responses": ["There are two types of diabetes that affect children: type 1 and type 2. Type 1 diabetes is thought to be caused by an autoimmune reaction (the body attacks itself by mistake) that stops your body from making insulin. With type 2 diabetes, your body doesn't use insulin well and can't keep blood sugar at normal levels. "]
	},

	{"tag": "diabetes symptoms",
	"patterns": ["what are the symptoms of diabetes", "what are the indicators of diabetes", "how do I know if someone has diabetes", "how can I tell if someone has diabetes", "what are indicators of diabetes", "can you tell me the symptoms of diabetes", "what should I look for to know if someone has diabetes", "what should I look for to know if my child has diabetes"],
	"responses": ["People who have type 1 diabetes may also have nausea, vomiting, or stomach pains. Type 1 diabetes symptoms can develop in just a few weeks or months and can be severe. Type 1 diabetes usually starts when you're a child, teen, or young adult but can happen at any age. Type 2 diabetes symptoms often take several years to develop. Some people don't notice any symptoms at all. Because symptoms are hard to spot, it's important to know the risk factors for type 2 diabetes such as: having prediabetes, being overweight, having family with diabetes type 2, and being African American, Hispanic/Latino American, American Indian, or Alaska Native. Make sure to visit your doctor if you have any of them."]
	},

	{"tag": "training",
	"patterns": ["train", "training"],
	"responses": ["First type out the response that I couldn't get right. Once that is done type out in the next line given to you what you hoped I'd do better. This will help train me to better answer questions.", "First type out the response that I couldn't get right. Once that is done type out in the next line given to you what you hoped I'd do better. Doing this will make me better at answering your questions", "First type out the response that I couldn't get right. Then type out what I can do to improve. This will help train me to better answer questions.", "First type out the response that I couldn't get right. Then type out what I can do to improve. Doing this will make me better at answering your questions", "First type out the response that I couldn't get right. Next right out how you'd like me to improve. This will help train me to better answer questions.", "First type out the response that I couldn't get right. Next right out how you'd like me to improve. Doing this will make me better at answering your questions", "Start by writing out what I messed up on. Once that is done type out in the next line given to you what you hoped I'd do better. This will help train me to better answer questions.", "Start by writing out what I messed up on. Once that is done type out in the next line given to you what you hoped I'd do better. Doing this will make me better at answering your questions", "Start by writing out what I messed up on. Then type out what I can do to improve. This will help train me to better answer questions.", "Start by writing out what I messed up on. Then type out what I can do to improve. Doing this will make me better at answering your questions", "Start by writing out what I messed up on. Next right out how you'd like me to improve. This will help train me to better answer questions.", "Start by writing out what I messed up on. Next right out how you'd like me to improve. Doing this will make me better at answering your questions"]
	}	

]}